Zimbo88/stm32-security-lab/tests/host_verifier/test_signed_image_verifier.c
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include "boot_slot.h"
#include "monocypher-ed25519.h"
#include "signed_image.h"
#include "stm32f429_memory_layout.h"

#define TEST_PAYLOAD_SIZE 256U

static uint8_t manifest[SIGNED_MANIFEST_SIZE];
static uint8_t signature[SIGNED_SIGNATURE_SIZE];
static uint8_t payload[MAX_PAYLOAD_SIZE];
static uint8_t secret_key[64];
static uint8_t public_key[FIRMWARE_PUBLIC_KEY_SIZE];
static int failures;

static void store_le32(uint8_t out[4], uint32_t value)
{
    out[0] = (uint8_t)(value & 0xFFU);
    out[1] = (uint8_t)((value >> 8) & 0xFFU);
    out[2] = (uint8_t)((value >> 16) & 0xFFU);
    out[3] = (uint8_t)((value >> 24) & 0xFFU);
}

static void expect_int(const char *name, int expected, int actual)
{
    if (actual != expected) {
        printf("%s: expected %d, got %d\n", name, expected, actual);
        failures += 1;
    }
}

static void expect_u32(const char *name, uint32_t expected, uint32_t actual)
{
    if (actual != expected) {
        printf(
            "%s: expected 0x%08lx, got 0x%08lx\n",
            name,
            (unsigned long)expected,
            (unsigned long)actual
        );
        failures += 1;
    }
}

static void expect_status(
    const char *name,
    verify_status_t expected,
    verify_status_t actual
)
{
    if (actual != expected) {
        printf(
            "%s: expected %s (%d), got %s (%d)\n",
            name,
            signed_image_status_text(expected),
            (int)expected,
            signed_image_status_text(actual),
            (int)actual
        );
        failures += 1;
    }
}

static void init_keys(void)
{
    uint8_t seed[32];

    for (uint32_t i = 0U; i < sizeof(seed); ++i) {
        seed[i] = (uint8_t)i;
    }

    crypto_ed25519_key_pair(secret_key, public_key, seed);
}

static void test_rfc8032_empty_message_vector(void)
{
    static const uint8_t public_key_vector[32] = {
        0xd7, 0x5a, 0x98, 0x01, 0x82, 0xb1, 0x0a, 0xb7,
        0xd5, 0x4b, 0xfe, 0xd3, 0xc9, 0x64, 0x07, 0x3a,
        0x0e, 0xe1, 0x72, 0xf3, 0xda, 0xa6, 0x23, 0x25,
        0xaf, 0x02, 0x1a, 0x68, 0xf7, 0x07, 0x51, 0x1a
    };
    static const uint8_t signature_vector[64] = {
        0xe5, 0x56, 0x43, 0x00, 0xc3, 0x60, 0xac, 0x72,
        0x90, 0x86, 0xe2, 0xcc, 0x80, 0x6e, 0x82, 0x8a,
        0x84, 0x87, 0x7f, 0x1e, 0xb8, 0xe5, 0xd9, 0x74,
        0xd8, 0x73, 0xe0, 0x65, 0x22, 0x49, 0x01, 0x55,
        0x5f, 0xb8, 0x82, 0x15, 0x90, 0xa3, 0x3b, 0xac,
        0xc6, 0x1e, 0x39, 0x70, 0x1c, 0xf9, 0xb4, 0x6b,
        0xd2, 0x5b, 0xf5, 0xf0, 0x59, 0x5b, 0xbe, 0x24,
        0x65, 0x51, 0x41, 0x43, 0x8e, 0x7a, 0x10, 0x0b
    };
    static const uint8_t sha512_empty[64] = {
        0xcf, 0x83, 0xe1, 0x35, 0x7e, 0xef, 0xb8, 0xbd,
        0xf1, 0x54, 0x28, 0x50, 0xd6, 0x6d, 0x80, 0x07,
        0xd6, 0x20, 0xe4, 0x05, 0x0b, 0x57, 0x15, 0xdc,
        0x83, 0xf4, 0xa9, 0x21, 0xd3, 0x6c, 0xe9, 0xce,
        0x47, 0xd0, 0xd1, 0x3c, 0x5d, 0x85, 0xf2, 0xb0,
        0xff, 0x83, 0x18, 0xd2, 0x87, 0x7e, 0xec, 0x2f,
        0x63, 0xb9, 0x31, 0xbd, 0x47, 0x41, 0x7a, 0x81,
        0xa5, 0x38, 0x32, 0x7a, 0xf9, 0x27, 0xda, 0x3e
    };
    uint8_t digest[64];

    expect_int(
        "RFC8032 empty Ed25519 vector",
        0,
        crypto_ed25519_check(signature_vector, public_key_vector, NULL, 0U)
    );
    crypto_sha512(digest, NULL, 0U);
    expect_int(
        "SHA-512 empty message vector",
        0,
        memcmp(digest, sha512_empty, sizeof(digest))
    );
}

static void write_manifest(
    uint32_t magic,
    uint32_t header_version,
    uint32_t image_version,
    uint32_t vector_address,
    uint32_t image_size,
    uint32_t flags,
    uint32_t reserved0,
    uint32_t reserved1,
    const uint8_t payload_hash[SIGNED_PAYLOAD_HASH_SIZE]
)
{
    store_le32(&manifest[offsetof(signed_manifest_t, magic)], magic);
    store_le32(
        &manifest[offsetof(signed_manifest_t, header_version)],
        header_version
    );
    store_le32(
        &manifest[offsetof(signed_manifest_t, image_version)],
        image_version
    );
    store_le32(
        &manifest[offsetof(signed_manifest_t, vector_address)],
        vector_address
    );
    store_le32(&manifest[offsetof(signed_manifest_t, image_size)], image_size);
    store_le32(&manifest[offsetof(signed_manifest_t, flags)], flags);
    store_le32(&manifest[offsetof(signed_manifest_t, reserved0)], reserved0);
    store_le32(&manifest[offsetof(signed_manifest_t, reserved1)], reserved1);
    memcpy(
        &manifest[offsetof(signed_manifest_t, payload_sha512)],
        payload_hash,
        SIGNED_PAYLOAD_HASH_SIZE
    );
}

static size_t bounded_payload_length(uint32_t image_size)
{
    if (image_size > (uint32_t)sizeof(payload)) {
        return sizeof(payload);
    }

    return (size_t)image_size;
}

static void build_image_with_vector_address(
    uint32_t image_version,
    uint32_t vector_address,
    uint32_t image_size,
    uint32_t msp,
    uint32_t reset,
    uint32_t flags,
    uint32_t reserved0,
    uint32_t reserved1
)
{
    uint8_t payload_hash[SIGNED_PAYLOAD_HASH_SIZE];
    const size_t hash_length = bounded_payload_length(image_size);
    size_t init_length = hash_length;

    if (init_length < APPLICATION_VECTOR_MIN_SIZE) {
        init_length = APPLICATION_VECTOR_MIN_SIZE;
    }

    memset(payload, 0xA5, init_length);
    store_le32(&payload[0], msp);
    store_le32(&payload[4], reset);

    crypto_sha512(payload_hash, payload, hash_length);
    write_manifest(
        SIGNED_IMAGE_MAGIC,
        SIGNED_HEADER_VERSION,
        image_version,
        vector_address,
        image_size,
        flags,
        reserved0,
        reserved1,
        payload_hash
    );
    crypto_ed25519_sign(signature, secret_key, manifest, SIGNED_MANIFEST_SIZE);
}

static void build_image(
    uint32_t image_version,
    uint32_t image_size,
    uint32_t msp,
    uint32_t reset,
    uint32_t flags,
    uint32_t reserved0,
    uint32_t reserved1
)
{
    build_image_with_vector_address(
        image_version,
        APPLICATION_BASE_ADDRESS,
        image_size,
        msp,
        reset,
        flags,
        reserved0,
        reserved1
    );
}

static void build_valid_image(void)
{
    build_image(
        MIN_IMAGE_VERSION,
        TEST_PAYLOAD_SIZE,
        APPLICATION_MSP_END,
        APPLICATION_BASE_ADDRESS | 1UL,
        0U,
        0U,
        0U
    );
}

