Zimbo88/stm32-security-lab/tests/host_verifier/test_signed_image_verifier.c
static verify_status_t verify_current(size_t payload_capacity)
{
    return signed_image_verify_buffer(
        manifest,
        signature,
        payload,
        payload_capacity,
        public_key
    );
}

static signed_image_jump_context_t valid_jump_context(uint32_t image_size)
{
    signed_image_jump_context_t context;

    context.vector_address = APPLICATION_BASE_ADDRESS;
    context.image_size = image_size;
    context.payload_end = APPLICATION_BASE_ADDRESS + image_size;
    context.initial_msp = APPLICATION_MSP_END;
    context.reset_vector = APPLICATION_BASE_ADDRESS | 1UL;
    context.reset_address = APPLICATION_BASE_ADDRESS;

    return context;
}

static signed_image_jump_context_t valid_slot_jump_context(
    const boot_slot_descriptor_t *slot,
    uint32_t image_size
)
{
    signed_image_jump_context_t context;

    context.vector_address = slot->payload_base;
    context.image_size = image_size;
    context.payload_end = slot->payload_base + image_size;
    context.initial_msp = APPLICATION_MSP_END;
    context.reset_vector = slot->payload_base | 1UL;
    context.reset_address = slot->payload_base;

    return context;
}

static void test_enum_values_are_stable(void)
{
    expect_int("VERIFY_OK", 0, (int)VERIFY_OK);
    expect_int("VERIFY_BAD_MAGIC", 1, (int)VERIFY_BAD_MAGIC);
    expect_int("VERIFY_BAD_HEADER_VERSION", 2, (int)VERIFY_BAD_HEADER_VERSION);
    expect_int("VERIFY_ROLLBACK_VERSION", 3, (int)VERIFY_ROLLBACK_VERSION);
    expect_int("VERIFY_BAD_VECTOR_ADDRESS", 4, (int)VERIFY_BAD_VECTOR_ADDRESS);
    expect_int("VERIFY_BAD_SIZE", 5, (int)VERIFY_BAD_SIZE);
    expect_int("VERIFY_BAD_STACK", 6, (int)VERIFY_BAD_STACK);
    expect_int("VERIFY_BAD_RESET_VECTOR", 7, (int)VERIFY_BAD_RESET_VECTOR);
    expect_int("VERIFY_BAD_PAYLOAD_HASH", 8, (int)VERIFY_BAD_PAYLOAD_HASH);
    expect_int("VERIFY_BAD_SIGNATURE", 9, (int)VERIFY_BAD_SIGNATURE);
    expect_int("VERIFY_BAD_FLAGS", 10, (int)VERIFY_BAD_FLAGS);
    expect_int("VERIFY_BAD_RESERVED", 11, (int)VERIFY_BAD_RESERVED);
    expect_int("VERIFY_BAD_PAYLOAD_RANGE", 12, (int)VERIFY_BAD_PAYLOAD_RANGE);
    expect_int(
        "VERIFY_BAD_TARGET_COMPATIBILITY",
        13,
        (int)VERIFY_BAD_TARGET_COMPATIBILITY
    );
    expect_int("VERIFY_BAD_IMAGE_TYPE", 14, (int)VERIFY_BAD_IMAGE_TYPE);
}

static void test_boot_slot_descriptors(void)
{
    const boot_slot_descriptor_t *slot = NULL;

    expect_int(
        "slot A lookup",
        BOOT_SLOT_LOOKUP_OK,
        boot_slot_lookup(BOOT_SLOT_A, &slot)
    );
    if (slot != NULL) {
        expect_int("slot A id", BOOT_SLOT_A, (int)slot->id);
        expect_u32(
            "slot A signed image",
            STM32F429_SLOT_A_SIGNED_IMAGE_BASE,
            slot->signed_image_base
        );
        expect_u32(
            "slot A manifest",
            STM32F429_SLOT_A_MANIFEST_BASE,
            slot->manifest_address
        );
        expect_u32(
            "slot A signature",
            STM32F429_SLOT_A_SIGNATURE_BASE,
            slot->signature_address
        );
        expect_u32(
            "slot A payload",
            STM32F429_SLOT_A_PAYLOAD_BASE,
            slot->payload_base
        );
        expect_u32("slot A end", STM32F429_SLOT_A_END, slot->slot_end);
        expect_u32(
            "slot A payload max",
            STM32F429_SLOT_A_PAYLOAD_MAX_SIZE,
            slot->maximum_payload_size
        );
        expect_u32(
            "slot A first sector",
            STM32F429_SLOT_A_FIRST_SECTOR,
            slot->first_sector
        );
        expect_u32(
            "slot A last sector",
            STM32F429_SLOT_A_LAST_SECTOR,
            slot->last_sector
        );
    }

    expect_int(
        "slot B lookup",
        BOOT_SLOT_LOOKUP_OK,
        boot_slot_lookup(BOOT_SLOT_B, &slot)
    );
    if (slot != NULL) {
        expect_int("slot B id", BOOT_SLOT_B, (int)slot->id);
        expect_u32(
            "slot B signed image",
            STM32F429_SLOT_B_SIGNED_IMAGE_BASE,
            slot->signed_image_base
        );
        expect_u32(
            "slot B manifest",
            STM32F429_SLOT_B_MANIFEST_BASE,
            slot->manifest_address
        );
        expect_u32(
            "slot B signature",
            STM32F429_SLOT_B_SIGNATURE_BASE,
            slot->signature_address
        );
        expect_u32(
            "slot B payload",
            STM32F429_SLOT_B_PAYLOAD_BASE,
            slot->payload_base
        );
        expect_u32("slot B end", STM32F429_SLOT_B_END, slot->slot_end);
        expect_u32(
            "slot B payload max",
            STM32F429_SLOT_B_PAYLOAD_MAX_SIZE,
            slot->maximum_payload_size
        );
        expect_u32(
            "slot B first sector",
            STM32F429_SLOT_B_FIRST_SECTOR,
            slot->first_sector
        );
        expect_u32(
            "slot B last sector",
            STM32F429_SLOT_B_LAST_SECTOR,
            slot->last_sector
        );
    }

    expect_int(
        "invalid slot lookup",
        BOOT_SLOT_LOOKUP_INVALID,
        boot_slot_lookup(2U, &slot)
    );
    if (slot != NULL) {
        printf("invalid slot lookup returned a descriptor\n");
        failures += 1;
    }

    expect_int(
        "null slot lookup",
        BOOT_SLOT_LOOKUP_INVALID,
        boot_slot_lookup(BOOT_SLOT_A, NULL)
    );

    slot = boot_slot_default();
    if (slot == NULL) {
        printf("default slot is null\n");
        failures += 1;
    } else {
        expect_int("default slot is A", BOOT_SLOT_A, (int)slot->id);
    }
}

static void test_valid_image(void)
{
    build_valid_image();
    expect_status("valid image", VERIFY_OK, verify_current(TEST_PAYLOAD_SIZE));
}

static void test_null_inputs_are_rejected(void)
{
    build_valid_image();
    expect_status(
        "null manifest",
        VERIFY_BAD_PAYLOAD_RANGE,
        signed_image_verify_buffer(
            NULL,
            signature,
            payload,
            TEST_PAYLOAD_SIZE,
            public_key
        )
    );
    expect_status(
        "null signature",
        VERIFY_BAD_PAYLOAD_RANGE,
        signed_image_verify_buffer(
            manifest,
            NULL,
            payload,
            TEST_PAYLOAD_SIZE,
            public_key
        )
    );
    expect_status(
        "null payload",
        VERIFY_BAD_PAYLOAD_RANGE,
        signed_image_verify_buffer(
            manifest,
            signature,
            NULL,
            TEST_PAYLOAD_SIZE,
            public_key
        )
    );
    expect_status(
        "null public key",
        VERIFY_BAD_PAYLOAD_RANGE,
        signed_image_verify_buffer(
            manifest,
            signature,
            payload,
            TEST_PAYLOAD_SIZE,
            NULL
        )
    );
}

