Zimbo88/stm32-security-lab/tests/host_verifier/test_signed_image_verifier.c
static void test_minimum_payload_length(void)
{
    build_image(
        MIN_IMAGE_VERSION,
        APPLICATION_VECTOR_MIN_SIZE,
        APPLICATION_MSP_END,
        APPLICATION_BASE_ADDRESS | 1UL,
        0U,
        0U,
        0U
    );
    expect_status(
        "minimum payload length",
        VERIFY_OK,
        verify_current(APPLICATION_VECTOR_MIN_SIZE)
    );
}

static void test_payload_capacity_one_byte_short(void)
{
    build_valid_image();
    expect_status(
        "payload capacity one byte short",
        VERIFY_BAD_PAYLOAD_RANGE,
        verify_current(TEST_PAYLOAD_SIZE - 1U)
    );
}

static void test_maximum_payload_length(void)
{
    build_image(
        MIN_IMAGE_VERSION,
        MAX_PAYLOAD_SIZE,
        APPLICATION_MSP_END,
        APPLICATION_BASE_ADDRESS | 1UL,
        0U,
        0U,
        0U
    );
    expect_status(
        "maximum payload length",
        VERIFY_OK,
        verify_current(MAX_PAYLOAD_SIZE)
    );
}

static void test_payload_one_byte_too_large(void)
{
    build_image(
        MIN_IMAGE_VERSION,
        MAX_PAYLOAD_SIZE + 1UL,
        APPLICATION_MSP_END,
        APPLICATION_BASE_ADDRESS | 1UL,
        0U,
        0U,
        0U
    );
    expect_status(
        "payload one byte too large",
        VERIFY_BAD_SIZE,
        verify_current(MAX_PAYLOAD_SIZE)
    );
}

static void test_jump_context_revalidation(void)
{
    signed_image_jump_context_t context = valid_jump_context(TEST_PAYLOAD_SIZE);
    const boot_slot_descriptor_t *slot_b = NULL;

    expect_status(
        "valid jump context",
        VERIFY_OK,
        signed_image_jump(&context)
    );
    expect_status(
        "null jump context",
        VERIFY_BAD_PAYLOAD_RANGE,
        signed_image_jump(NULL)
    );

    context = valid_jump_context(TEST_PAYLOAD_SIZE);
    context.initial_msp = APPLICATION_MSP_END - 4UL;
    expect_status(
        "jump context bad MSP",
        VERIFY_BAD_STACK,
        signed_image_jump(&context)
    );

    context = valid_jump_context(TEST_PAYLOAD_SIZE);
    context.reset_vector = APPLICATION_BASE_ADDRESS;
    expect_status(
        "jump context bad reset",
        VERIFY_BAD_RESET_VECTOR,
        signed_image_jump(&context)
    );

    context = valid_jump_context(TEST_PAYLOAD_SIZE);
    context.payload_end += APPLICATION_MSP_ALIGNMENT;
    expect_status(
        "jump context inconsistent payload end",
        VERIFY_BAD_PAYLOAD_RANGE,
        signed_image_jump(&context)
    );

    context = valid_jump_context(TEST_PAYLOAD_SIZE);
    context.vector_address += APPLICATION_VTOR_ALIGNMENT;
    expect_status(
        "jump context bad vector address",
        VERIFY_BAD_VECTOR_ADDRESS,
        signed_image_jump(&context)
    );

    expect_int(
        "lookup slot B for jump",
        BOOT_SLOT_LOOKUP_OK,
        boot_slot_lookup(BOOT_SLOT_B, &slot_b)
    );
    if (slot_b != NULL) {
        context = valid_slot_jump_context(slot_b, TEST_PAYLOAD_SIZE);
        expect_status(
            "valid slot B jump context",
            VERIFY_OK,
            signed_image_jump(&context)
        );
    }
}

static void test_bad_magic(void)
{
    build_valid_image();
    manifest[offsetof(signed_manifest_t, magic)] ^= 0x01U;
    expect_status("bad magic", VERIFY_BAD_MAGIC, verify_current(sizeof(payload)));
}

static void test_unsupported_header_version(void)
{
    build_valid_image();
    store_le32(
        &manifest[offsetof(signed_manifest_t, header_version)],
        SIGNED_HEADER_VERSION + 1UL
    );
    expect_status(
        "unsupported header version",
        VERIFY_BAD_HEADER_VERSION,
        verify_current(sizeof(payload))
    );
}

static void test_invalid_payload_length(void)
{
    build_valid_image();
    store_le32(
        &manifest[offsetof(signed_manifest_t, image_size)],
        APPLICATION_MIN_SIZE - 1UL
    );
    expect_status(
        "invalid payload length",
        VERIFY_BAD_SIZE,
        verify_current(sizeof(payload))
    );
}

static void test_bad_vector_address(void)
{
    build_image_with_vector_address(
        MIN_IMAGE_VERSION,
        APPLICATION_BASE_ADDRESS + APPLICATION_VTOR_ALIGNMENT,
        TEST_PAYLOAD_SIZE,
        APPLICATION_MSP_END,
        APPLICATION_BASE_ADDRESS | 1UL,
        0U,
        0U,
        0U
    );
    expect_status(
        "bad manifest vector address",
        VERIFY_BAD_VECTOR_ADDRESS,
        verify_current(TEST_PAYLOAD_SIZE)
    );
}

static void test_address_overflow(void)
{
    build_valid_image();
    store_le32(&manifest[offsetof(signed_manifest_t, image_size)], UINT32_MAX);
    expect_status(
        "address overflow",
        VERIFY_BAD_PAYLOAD_RANGE,
        verify_current(sizeof(payload))
    );
}

static void test_bad_msp(void)
{
    build_image(
        MIN_IMAGE_VERSION,
        TEST_PAYLOAD_SIZE,
        APPLICATION_MSP_BASE,
        APPLICATION_BASE_ADDRESS | 1UL,
        0U,
        0U,
        0U
    );
    expect_status("bad MSP", VERIFY_BAD_STACK, verify_current(sizeof(payload)));
}

static void test_lowest_aligned_msp(void)
{
    build_image(
        MIN_IMAGE_VERSION,
        TEST_PAYLOAD_SIZE,
        APPLICATION_MSP_BASE + APPLICATION_MSP_ALIGNMENT,
        APPLICATION_BASE_ADDRESS | 1UL,
        0U,
        0U,
        0U
    );
    expect_status(
        "lowest aligned MSP",
        VERIFY_OK,
        verify_current(TEST_PAYLOAD_SIZE)
    );
}

static void test_highest_msp(void)
{
    build_image(
        MIN_IMAGE_VERSION,
        TEST_PAYLOAD_SIZE,
        APPLICATION_MSP_END,
        APPLICATION_BASE_ADDRESS | 1UL,
        0U,
        0U,
        0U
    );
    expect_status("highest MSP", VERIFY_OK, verify_current(TEST_PAYLOAD_SIZE));
}

static void test_msp_above_supported_sram(void)
{
    build_image(
        MIN_IMAGE_VERSION,
        TEST_PAYLOAD_SIZE,
        APPLICATION_MSP_END + APPLICATION_MSP_ALIGNMENT,
        APPLICATION_BASE_ADDRESS | 1UL,
        0U,
        0U,
        0U
    );
    expect_status(
        "MSP above supported SRAM",
        VERIFY_BAD_STACK,
        verify_current(sizeof(payload))
    );
}

static void test_unaligned_msp(void)
{
    build_image(
        MIN_IMAGE_VERSION,
        TEST_PAYLOAD_SIZE,
        APPLICATION_MSP_END - 4UL,
        APPLICATION_BASE_ADDRESS | 1UL,
        0U,
        0U,
        0U
    );
    expect_status(
        "unaligned MSP",
        VERIFY_BAD_STACK,
        verify_current(sizeof(payload))
    );
}

static void test_bad_reset_vector(void)
{
    build_image(
        MIN_IMAGE_VERSION,
        TEST_PAYLOAD_SIZE,
        APPLICATION_MSP_END,
        APPLICATION_BASE_ADDRESS,
        0U,
        0U,
        0U
    );
    expect_status(
        "bad reset vector",
        VERIFY_BAD_RESET_VECTOR,
        verify_current(sizeof(payload))
    );
}

static void test_last_payload_reset_vector(void)
{
    build_image(
        MIN_IMAGE_VERSION,
        TEST_PAYLOAD_SIZE,
        APPLICATION_MSP_END,
        (APPLICATION_BASE_ADDRESS + TEST_PAYLOAD_SIZE - 2UL) | 1UL,
        0U,
        0U,
        0U
    );
    expect_status(
        "last payload reset vector",
        VERIFY_OK,
        verify_current(TEST_PAYLOAD_SIZE)
    );
}

static void test_reset_vector_before_payload(void)
{
    build_image(
        MIN_IMAGE_VERSION,
        TEST_PAYLOAD_SIZE,
        APPLICATION_MSP_END,
        (APPLICATION_BASE_ADDRESS - 2UL) | 1UL,
        0U,
        0U,
        0U
    );
    expect_status(
        "reset before payload",
        VERIFY_BAD_RESET_VECTOR,
        verify_current(sizeof(payload))
    );
}

