Zimbo88/stm32-security-lab/tests/host_verifier/test_signed_image_verifier.c
static void test_reset_vector_outside_payload(void)
{
    build_image(
        MIN_IMAGE_VERSION,
        TEST_PAYLOAD_SIZE,
        APPLICATION_MSP_END,
        (APPLICATION_BASE_ADDRESS + TEST_PAYLOAD_SIZE) | 1UL,
        0U,
        0U,
        0U
    );
    expect_status(
        "reset outside payload",
        VERIFY_BAD_RESET_VECTOR,
        verify_current(sizeof(payload))
    );
}

static void test_reset_vector_at_flash_end(void)
{
    build_image(
        MIN_IMAGE_VERSION,
        MAX_PAYLOAD_SIZE,
        APPLICATION_MSP_END,
        APPLICATION_FLASH_END | 1UL,
        0U,
        0U,
        0U
    );
    expect_status(
        "reset at flash end",
        VERIFY_BAD_RESET_VECTOR,
        verify_current(MAX_PAYLOAD_SIZE)
    );
}

static void test_modified_payload(void)
{
    build_valid_image();
    payload[16] ^= 0x80U;
    expect_status(
        "modified payload",
        VERIFY_BAD_PAYLOAD_HASH,
        verify_current(sizeof(payload))
    );
}

static void test_modified_signature(void)
{
    build_valid_image();
    signature[0] ^= 0x01U;
    expect_status(
        "modified signature",
        VERIFY_BAD_SIGNATURE,
        verify_current(sizeof(payload))
    );
}

static void test_unsupported_flags(void)
{
    build_image(
        MIN_IMAGE_VERSION,
        TEST_PAYLOAD_SIZE,
        APPLICATION_MSP_END,
        APPLICATION_BASE_ADDRESS | 1UL,
        1U,
        0U,
        0U
    );
    expect_status(
        "unsupported flags",
        VERIFY_BAD_FLAGS,
        verify_current(sizeof(payload))
    );
}

static void test_unsupported_high_flag_bit(void)
{
    build_image(
        MIN_IMAGE_VERSION,
        TEST_PAYLOAD_SIZE,
        APPLICATION_MSP_END,
        APPLICATION_BASE_ADDRESS | 1UL,
        0x80000000UL,
        0U,
        0U
    );
    expect_status(
        "unsupported high flag bit",
        VERIFY_BAD_FLAGS,
        verify_current(sizeof(payload))
    );
}

static void test_noncanonical_reserved_fields(void)
{
    build_image(
        MIN_IMAGE_VERSION,
        TEST_PAYLOAD_SIZE,
        APPLICATION_MSP_END,
        APPLICATION_BASE_ADDRESS | 1UL,
        0U,
        1U,
        0U
    );
    expect_status(
        "noncanonical reserved fields",
        VERIFY_BAD_RESERVED,
        verify_current(sizeof(payload))
    );
}

static void test_noncanonical_reserved1(void)
{
    build_image(
        MIN_IMAGE_VERSION,
        TEST_PAYLOAD_SIZE,
        APPLICATION_MSP_END,
        APPLICATION_BASE_ADDRESS | 1UL,
        0U,
        0U,
        1U
    );
    expect_status(
        "noncanonical reserved1",
        VERIFY_BAD_RESERVED,
        verify_current(sizeof(payload))
    );
}

static void test_rollback_rejection(void)
{
    build_image(
        MIN_IMAGE_VERSION - 1UL,
        TEST_PAYLOAD_SIZE,
        APPLICATION_MSP_END,
        APPLICATION_BASE_ADDRESS | 1UL,
        0U,
        0U,
        0U
    );
    expect_status(
        "rollback rejection",
        VERIFY_ROLLBACK_VERSION,
        verify_current(sizeof(payload))
    );
}

static void test_update_package_slot_b_verification(void)
{
    const boot_slot_descriptor_t *slot_b = NULL;
    const boot_slot_descriptor_t *slot_a = NULL;

    expect_int(
        "slot B for update package",
        BOOT_SLOT_LOOKUP_OK,
        boot_slot_lookup(BOOT_SLOT_B, &slot_b)
    );
    expect_int(
        "slot A for update package mismatch",
        BOOT_SLOT_LOOKUP_OK,
        boot_slot_lookup(BOOT_SLOT_A, &slot_a)
    );

    build_image_with_vector_address(
        MIN_IMAGE_VERSION + 1UL,
        STM32F429_SLOT_B_PAYLOAD_BASE,
        TEST_PAYLOAD_SIZE,
        APPLICATION_MSP_END,
        STM32F429_SLOT_B_PAYLOAD_BASE | 1UL,
        0U,
        UPDATE_PACKAGE_TARGET_STM32F429IGT6_AB_V1,
        UPDATE_PACKAGE_IMAGE_TYPE_APPLICATION
    );
    store_le32(
        &manifest[offsetof(signed_manifest_t, header_version)],
        UPDATE_PACKAGE_FORMAT_VERSION
    );
    crypto_ed25519_sign(signature, secret_key, manifest, SIGNED_MANIFEST_SIZE);

    expect_status(
        "update package slot B",
        VERIFY_OK,
        signed_image_verify_update_slot_buffer(
            manifest,
            signature,
            payload,
            TEST_PAYLOAD_SIZE,
            public_key,
            slot_b
        )
    );
    expect_status(
        "v2 package rejected by legacy verifier",
        VERIFY_BAD_HEADER_VERSION,
        signed_image_verify_buffer(
            manifest,
            signature,
            payload,
            TEST_PAYLOAD_SIZE,
            public_key
        )
    );
    expect_status(
        "slot B package rejected for slot A",
        VERIFY_BAD_VECTOR_ADDRESS,
        signed_image_verify_update_slot_buffer(
            manifest,
            signature,
            payload,
            TEST_PAYLOAD_SIZE,
            public_key,
            slot_a
        )
    );
}

static void test_update_package_rejects_bad_authenticated_fields(void)
{
    const boot_slot_descriptor_t *slot_b = NULL;

    expect_int(
        "slot B for bad authenticated fields",
        BOOT_SLOT_LOOKUP_OK,
        boot_slot_lookup(BOOT_SLOT_B, &slot_b)
    );

    build_image_with_vector_address(
        MIN_IMAGE_VERSION + 1UL,
        STM32F429_SLOT_B_PAYLOAD_BASE,
        TEST_PAYLOAD_SIZE,
        APPLICATION_MSP_END,
        STM32F429_SLOT_B_PAYLOAD_BASE | 1UL,
        0U,
        UPDATE_PACKAGE_TARGET_STM32F429IGT6_AB_V1 + 1UL,
        UPDATE_PACKAGE_IMAGE_TYPE_APPLICATION
    );
    store_le32(
        &manifest[offsetof(signed_manifest_t, header_version)],
        UPDATE_PACKAGE_FORMAT_VERSION
    );
    crypto_ed25519_sign(signature, secret_key, manifest, SIGNED_MANIFEST_SIZE);
    expect_status(
        "bad update target compatibility",
        VERIFY_BAD_TARGET_COMPATIBILITY,
        signed_image_verify_update_slot_buffer(
            manifest,
            signature,
            payload,
            TEST_PAYLOAD_SIZE,
            public_key,
            slot_b
        )
    );

    build_image_with_vector_address(
        MIN_IMAGE_VERSION + 1UL,
        STM32F429_SLOT_B_PAYLOAD_BASE,
        TEST_PAYLOAD_SIZE,
        APPLICATION_MSP_END,
        STM32F429_SLOT_B_PAYLOAD_BASE | 1UL,
        0U,
        UPDATE_PACKAGE_TARGET_STM32F429IGT6_AB_V1,
        UPDATE_PACKAGE_IMAGE_TYPE_APPLICATION + 1UL
    );
    store_le32(
        &manifest[offsetof(signed_manifest_t, header_version)],
        UPDATE_PACKAGE_FORMAT_VERSION
    );
    crypto_ed25519_sign(signature, secret_key, manifest, SIGNED_MANIFEST_SIZE);
    expect_status(
        "bad update image type",
        VERIFY_BAD_IMAGE_TYPE,
        signed_image_verify_update_slot_buffer(
            manifest,
            signature,
            payload,
            TEST_PAYLOAD_SIZE,
            public_key,
            slot_b
        )
    );
}

int main(void)
{
    init_keys();

    test_rfc8032_empty_message_vector();
    test_enum_values_are_stable();
    test_boot_slot_descriptors();
    test_valid_image();
    test_null_inputs_are_rejected();
    test_minimum_payload_length();
    test_payload_capacity_one_byte_short();
    test_maximum_payload_length();
    test_payload_one_byte_too_large();
    test_jump_context_revalidation();
    test_bad_magic();
    test_unsupported_header_version();
    test_invalid_payload_length();
    test_bad_vector_address();
    test_address_overflow();
    test_bad_msp();
    test_lowest_aligned_msp();
    test_highest_msp();
    test_msp_above_supported_sram();
    test_unaligned_msp();
    test_bad_reset_vector();
    test_last_payload_reset_vector();
    test_reset_vector_before_payload();
    test_reset_vector_outside_payload();
    test_reset_vector_at_flash_end();
    test_modified_payload();
    test_modified_signature();
    test_unsupported_flags();
    test_unsupported_high_flag_bit();
    test_noncanonical_reserved_fields();
    test_noncanonical_reserved1();
    test_rollback_rejection();
    test_update_package_slot_b_verification();
    test_update_package_rejects_bad_authenticated_fields();

    if (failures != 0) {
        printf("host verifier tests failed: %d\n", failures);
        return 1;
    }

    printf("host verifier tests passed\n");
    return 0;
}
